devdnl/dnx-rtos/src/system/drivers/dma/stm32f3/dma.c
        device_stat->st_size = 0;

        return ESUCC;
}

//==============================================================================
/**
 * @brief Function allocate selected stream.
 *
 * @param [in]  major         DMA peripheral number.
 * @param [in]  channel       channel number [1..7].
 *
 * @return On success DMA descriptor number, otherwise 0.
 */
//==============================================================================
u32_t _DMA_DDI_reserve(u8_t major, u8_t channel)
{
        int dmad = 0;
        channel--;

        if (DMA_RT[major] == NULL) {
                printk("DMA%d: not initialized", major + 1);
                return dmad;
        }

        if (major < DMA_COUNT && (channel < DMA_HW[major].chcnt)) {
                sys_critical_section_begin();
                {
                        if (DMA_RT[major]->channel[channel].dmad == 0) {
                                u32_t ID = DMA_RT[major]->ID_cnt++;

                                dmad = DMAD(major, channel, ID);

                                DMA_RT[major]->channel[channel].dmad = dmad;

                                if (DMA_RT[major]->ID_cnt == 0) {
                                        DMA_RT[major]->ID_cnt++;
                                }
                        }
                }
                sys_critical_section_end();
        }

        return dmad;
}

//==============================================================================
/**
 * @brief Function free allocated stream.
 *
 * @param dmad                  DMA descriptor.
 */
//==============================================================================
void _DMA_DDI_release(u32_t dmad)
{
        if (dmad && DMA_RT[GETMAJOR(dmad)]) {
                DMA_RT_channel_t *RT_channel = &DMA_RT[GETMAJOR(dmad)]->channel[GETCHANNEL(dmad)];

                if (RT_channel->dmad == dmad) {

                        DMA_Channel_TypeDef *DMA_channel = DMA_HW[GETMAJOR(dmad)].channel[GETCHANNEL(dmad)];

                        RT_channel->cb_finish = NULL;
                        RT_channel->cb_half   = NULL;
                        RT_channel->cb_next   = NULL;
                        DMA_channel->CCR      = 0;

                        clear_DMA_IRQ_flags(GETMAJOR(dmad), GETCHANNEL(dmad));

                        DMA_channel->CMAR  = 0;
                        DMA_channel->CNDTR = 0;
                        DMA_channel->CPAR  = 0;

                        memset(RT_channel, 0, sizeof(DMA_RT_channel_t));
                }
        }
}


//==============================================================================
/**
 * @brief Function reaturn DMA steram according to DMA descriptor.
 *
 * @param dmad                  DMA descriptor.
 * @param channel               channel
 *
 * @return One of errno value.
 */
//==============================================================================
int _DMA_DDI_get_channel(u32_t dmad, DMA_Channel_TypeDef **channel)
{
        int err = EINVAL;

        if (dmad && DMA_RT[GETMAJOR(dmad)] && channel) {
                DMA_RT_channel_t *RT_channel = &DMA_RT[GETMAJOR(dmad)]->channel[GETCHANNEL(dmad)];

                if (RT_channel->dmad == dmad) {

                        DMA_Channel_TypeDef *DMA_channel = DMA_HW[GETMAJOR(dmad)].channel[GETCHANNEL(dmad)];
                        *channel = DMA_channel;
                        err = 0;

                } else {
                        err = ENODEV;
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief Function start transfer. The IRQ flags (TCIE, TEIE) are added
 *        automatically.
 *
 * @param dmad                  DMA descriptor.
 * @param config                DMA configuration.
 *
 * @return One of errno value.
 */
//==============================================================================
int _DMA_DDI_transfer(u32_t dmad, _DMA_DDI_config_t *config)
{
        int err = EINVAL;

        if (  dmad
           && DMA_RT[GETMAJOR(dmad)]
           && config
           && config->NDT
           && config->PA
           && config->MA) {

                DMA_RT_channel_t    *RT_channel = &DMA_RT[GETMAJOR(dmad)]->channel[GETCHANNEL(dmad)];
                DMA_Channel_TypeDef *DMA_Stream = DMA_HW[GETMAJOR(dmad)].channel[GETCHANNEL(dmad)];
                IRQn_Type            IRQn       = DMA_HW[GETMAJOR(dmad)].IRQn[GETCHANNEL(dmad)];

                if (RT_channel->dmad == dmad) {
                        DMA_Stream->CMAR  = config->MA;
                        DMA_Stream->CNDTR = config->NDT;
                        DMA_Stream->CPAR  = config->PA;
                        DMA_Stream->CCR   = config->CR & ~DMA_CCR_EN;

                        RT_channel->arg       = config->arg;
                        RT_channel->cb_finish = config->cb_finish;
                        RT_channel->cb_half   = config->cb_half;
                        RT_channel->cb_next   = config->cb_next;
                        RT_channel->release   = config->release;

                        clear_DMA_IRQ_flags(GETMAJOR(dmad), GETCHANNEL(dmad));
                        NVIC_SetPriority(IRQn, config->IRQ_priority);
                        NVIC_ClearPendingIRQ(IRQn);
                        NVIC_EnableIRQ(IRQn);

                        SET_BIT(DMA_Stream->CCR, DMA_CCR_TCIE | DMA_CCR_TEIE | (config->cb_half ? DMA_CCR_HTIE : 0));
                        SET_BIT(DMA_Stream->CCR, DMA_CCR_EN);

                        err = ESUCC;
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief Function start memory-to-memory transfer by using free channel.
 *
 * @param dst                   destination address.
 * @param src                   source address.
 * @param size                  block size.
 *
 * @return One of errno value.
 */
//==============================================================================
int _DMA_DDI_memcpy(void *dst, const void *src, size_t size)
{
        /*
         * Only DMA2 is able to transfer data in memory-to-memory mode.
         */
        if (DMA_COUNT < 2) {
                return ENXIO;
        }

        if (!sys_is_mem_dma_capable(dst) || !sys_is_mem_dma_capable(src)) {
                return EIO;
        }

        DMA_RT_t *hdl = DMA_RT[1];
        if (!hdl || !dst || !src || !size) {
                return EINVAL;
        }

        int err = EBUSY;

